import 'package:get/get.dart';

class Mylocale implements Translations{
  @override
  Map<String, Map<String, String>> get keys => {
    "ar":{
      "1":"ادارة لقاحات",
      "2":"حدث خطأ:",
      "3":"لا توجد لقاحات متاحة",
      "4":"تعديل",
      "5":"حذف",
      "6":"اسم لقاح",
      "7":"الوصف",
      "8":"هذا حقل مطلوب",
    
      "9":"الرئيسية",
      "10":"تعديل التعليق",
      "11":"التطعيمات القادمة",
      "12":"التطعيمات",
      "13":"التعليقات",
      "14":"اضافة تعليق",
      "15":"اسم المستخدم",
      "16":"كلمة المرور",
      "17":"تسجيل الدخول",
      "18":"حفظ",
      "19":"تعديل البروفايل",
      "20":"مرحبا بعودتك",
      "21":"الرجوع",
      "22":"ابدأ",
      "23":"الاشعارات",
      "24":"التطعيمات المكتملة",
      "25":"التطعيمات قيد الانتظار",
      "26":"االعودة الى الرييسية",
      "27":"حفظ التعديلات",
      "29": "أهمية التطعيمات",
      "30":"التطعيمات تحمي طفلك من الأمراض\n الخطيرة وتساعد في \n  بناء مناعته. استثمر في صحة طفلك اليوم",
      "31":"مستقبل صحي",
      "32":"التطعيمات تحمي طفلك من الامراض  \n الخطيرة وتساعد في بناء مناعتةاستثمر في \n صحة طفلك اليوم!",
      "33":"مواعيد التطعيمات",
      "34":"حافظ على صحة طفلك:اكتشف \n مواعيد التطعيمات اللازمة لكل مرحلة\n من مراحل نموه.",
      "35":"الاسم",
      "38":"التطعيمات",

      },
    "en":{
      },
      
  };
}